Import the Pandas Library

In [3]:
import pandas as pd
from pprint import pprint as pp

#### 1) Create a dictionary with the data in the table below.


![Capture.PNG]()

In [4]:
data = {
    "Animal": ["Cat", "Cat", "Snake", "Dog", "Dog", "Cat", "Snake", "Cat", "Dog", "Dog"],
    "Age": [2.5, 3, 0.5, 2, 5, 2, 4.5, 3, 7, 3],
    "Visits": [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    "Priority": ["Yes", "Yes", "No", "Yes", "No", "No", "No", "Yes", "No", "No"]
}

pp(data)

{'Age': [2.5, 3, 0.5, 2, 5, 2, 4.5, 3, 7, 3],
 'Animal': ['Cat',
            'Cat',
            'Snake',
            'Dog',
            'Dog',
            'Cat',
            'Snake',
            'Cat',
            'Dog',
            'Dog'],
 'Priority': ['Yes', 'Yes', 'No', 'Yes', 'No', 'No', 'No', 'Yes', 'No', 'No'],
 'Visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]}

##### Also create a list with the labels below.
labels: a, b, c, d, e, f, g, h, i, j

In [7]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 2) Create a dataframe with the above dictionary that has the above labels as index

In [6]:
import pandas as pd

df = pd.DataFrame(data, index=labels)
df

  Animal  Age  Visits Priority
a    Cat  2.5       1      Yes
b    Cat  3.0       3      Yes
c  Snake  0.5       2       No
d    Dog  2.0       3      Yes
e    Dog  5.0       2       No
f    Cat  2.0       3       No
g  Snake  4.5       1       No
h    Cat  3.0       1      Yes
i    Dog  7.0       2       No
j    Dog  3.0       1       No

#### 3) Get a summary of the basic information for this dataframe and the descriptive statistics of it

In [8]:
df.describe()

             Age     Visits
count  10.000000  10.000000
mean    3.250000   1.900000
std     1.829542   0.875595
min     0.500000   1.000000
25%     2.125000   1.000000
50%     3.000000   2.000000
75%     4.125000   2.750000
max     7.000000   3.000000

#### 4) Get the first 4 rows of this dataframe

In [9]:
df.head(4)

  Animal  Age  Visits Priority
a    Cat  2.5       1      Yes
b    Cat  3.0       3      Yes
c  Snake  0.5       2       No
d    Dog  2.0       3      Yes

#### 5) Get only the Animal and priority columns of the dataframe

In [10]:
df[["Animal", "Priority"]]

  Animal Priority
a    Cat      Yes
b    Cat      Yes
c  Snake       No
d    Dog      Yes
e    Dog       No
f    Cat       No
g  Snake       No
h    Cat      Yes
i    Dog       No
j    Dog       No

#### 6) Select the data from rows 4,5 & 6 and display only the animal and visits column

In [12]:
df.loc[['d', 'e', 'f'], ['Animal', 'Visits']]

  Animal  Visits
d    Dog       3
e    Dog       2
f    Cat       3

#### 7) Get only the rows where the age is greater than 2

In [13]:
df[df['Age'] > 2]

  Animal  Age  Visits Priority
a    Cat  2.5       1      Yes
b    Cat  3.0       3      Yes
e    Dog  5.0       2       No
g  Snake  4.5       1       No
h    Cat  3.0       1      Yes
i    Dog  7.0       2       No
j    Dog  3.0       1       No

#### 8) Get the rows where the animal is a dog and the age is greater than 3

In [14]:
df[(df['Animal'] == 'Dog') & (df['Age'] > 3)]

  Animal  Age  Visits Priority
e    Dog  5.0       2       No
i    Dog  7.0       2       No

#### 9) Get the rows where the age is between 3 and 7 (both included)

In [15]:
df[(df['Age'] >= 3) & (df['Age'] <= 7)]

  Animal  Age  Visits Priority
b    Cat  3.0       3      Yes
e    Dog  5.0       2       No
g  Snake  4.5       1       No
h    Cat  3.0       1      Yes
i    Dog  7.0       2       No
j    Dog  3.0       1       No

#### 10) Get the row where the age is 4.5 and change it to 5

In [16]:
df.loc[df['Age'] == 4.5, 'Age'] = 5

#### 11) Loop through each row and print the animal and visits if the visit is smaller than 2

In [17]:
for index, row in df.iterrows():
    if row['Visits'] < 2:
        print(f"Animal: {row['Animal']}, Visits: {row['Visits']}")

Animal: Cat, Visits: 1
Animal: Snake, Visits: 1
Animal: Cat, Visits: 1
Animal: Dog, Visits: 1

#### 12) Calculate the total number of visits

In [18]:
df['Visits'].sum()

19

#### 13) (Bonus) Calculate the mean age for each of the animal type (Hint: use groupy)

In [19]:
df.groupby('Animal')['Age'].mean()

Animal
Cat      2.625
Dog      4.250
Snake    2.750
Name: Age, dtype: float64